<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Powershell.</string>
    <key>Identifier</key>
    <string>uk.co.cloud-seven.download.Powershell</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Powershell</string>
        <key>SEARCH_URL</key>
        <string>https://github.com/PowerShell/PowerShell/releases/latest</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https:\/\/github.com\/PowerShell\/releases\/download\/(?P&lt;v&gt;[0-9.]+)\/powershell-[0-9.]+-osx-x64\.pkg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
